export class Translate {
    // -------------------------------------------------------------------------------------------------------------------------------------------------------------
    static translate(text/*, context*/) {

        const dict = {
            'ADD': 'Добавить',
            'ADD NEW RECORD': 'Добавить новую строку',
            'COLLAPSE': 'Свернуть',
            'COPY': 'Копировать',
            'COPY RECORD': 'Копировать строку',
            'CLEAR ALL FILTERS': 'Очистить все фильтры',
            'COMMIT': 'Сохранить',
            'COMMIT CHANGES': 'Сохранить изменения',
            'CURRENT PAGE': 'Текущая страница',
            'DELETE': 'Удалить',
            'DELETE RECORD': 'Удалить строку',
            'EXPAND': 'Развернуть',
            'FIRST': 'К началу',
            'LAST': 'В конец',
            'LOAD MORE RECORDS': 'Загрузить еще строк',
            'MORE...': 'еще...',
            'NEXT': 'Следующая',
            'OF': 'из',
            'PAGE SIZE': 'Размер страницы',
            'PREV': 'Предыдущая',
            'REFRESH': 'Обновить',
            'RESET COLUMNS ORDER': 'Сбросить порядок колонок',
            'RESET COLUMNS SORT': 'Сбросить сортировку колонок',
            'RESET COLUMNS WIDTHS': 'Сбросить ширину колонок',
            'ROLLBACK': 'Откатить',
            'ROLLBACK CHANGES': 'Откатить изменения',
            'SETTINGS': 'Настройки',
            'SELECT': 'Выбор',
            'SELECT VALUE': 'Выбрать значение',
            'TOTAL PAGES': 'Всего страниц',
            'TOTAL ROWS': 'Всего строк',
            'VIEW': 'Просмотр',
            'VIEW RECORD': 'Карточка',
        };
        return dict[text.toUpperCase()] || text;
    }
    // -------------------------------------------------------------------------------------------------------------------------------------------------------------
}